BVO93/TI_CC2640R2_GetttingStarted/adc_window_monitor_launchpad_tirtos/Debug/configPkg/package/cfg/rom_pem4f.c
    xdc_runtime_System_exit(stat);
}

/*
 *  ======== BIOS_errorRaiseHook ========
 */
Void ti_sysbios_BIOS_errorRaiseHook(xdc_runtime_Error_Block *eb)
{
    /*
     * If this is an Assert thread, defang Gate threadtype check
     */
    if (eb->id == xdc_runtime_Assert_E_assertFailed) {
        /* remove the RTS lock */
        ti_sysbios_BIOS_removeRTSLock();
        /* force thread type to 'Main' */
        ti_sysbios_BIOS_setThreadType(ti_sysbios_BIOS_ThreadType_Main);
    }
}

/*
 * ======== ti.sysbios.Build TEMPLATE ========
 */


/*
 * ======== ti.sysbios.family.arm.m3.Hwi TEMPLATE ========
 */

extern Void _c_int00(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);
extern Void ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I(Void);


#pragma DATA_SECTION(ti_sysbios_family_arm_m3_Hwi_resetVectors, ".resetVecs");

/* const because it is meant to be placed in ROM */
const UInt32 ti_sysbios_family_arm_m3_Hwi_resetVectors[] = {
    (UInt32)(&__TI_STACK_BASE),
    (UInt32)(&_c_int00),
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),            /* NMI */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),      /* Hard Fault */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* Mem Fault */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* Bus Fault */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),     /* Usage Fault */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* reserved */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* reserved */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* reserved */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* reserved */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),         /* SVCall */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* Debug Mon */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I),       /* reserved */
    (UInt32)(&ti_sysbios_family_arm_m3_Hwi_pendSV__I),  /* pendSV */
};

#pragma DATA_SECTION(ti_sysbios_family_arm_m3_Hwi_ramVectors, ".vecs");

/* place holder for RAM vector table */
UInt32 ti_sysbios_family_arm_m3_Hwi_ramVectors[54];

UInt32 ti_sysbios_family_arm_m3_Hwi_dispatchTable[54];

#if defined(__IAR_SYSTEMS_ICC__)
Void ti_sysbios_family_arm_m3_Hwi_initIsrStackSize()
{
    #pragma section = "CSTACK"
    ti_sysbios_family_arm_m3_Hwi_Module__state__V.isrStackBase = (Void *)__section_begin("CSTACK");
    size_t size = (uint8_t *)__section_end("CSTACK") - (uint8_t *)__section_begin("CSTACK");
    ti_sysbios_family_arm_m3_Hwi_Module__state__V.isrStackSize = (Void *)size;
}
#endif

/*
 * ======== ti.sysbios.family.arm.cc26xx.Boot TEMPLATE ========
 */


#include <ti/devices/DeviceFamily.h>

#include DeviceFamily_constructPath(inc/hw_types.h)


extern Void _c_int00();

Void ResetISR ()
{
    _c_int00();
}

/* workaround bug in driverlib */

/*
 * ======== ti.sysbios.hal.Seconds TEMPLATE ========
 */



#if defined(__ti__) && !defined(__clang__)

#pragma FUNC_EXT_CALLED(time);

#define ATTRIBUTE

#elif defined(__IAR_SYSTEMS_ICC__)

#define ATTRIBUTE

#else

#define ATTRIBUTE __attribute__ ((used))

#endif

#include <xdc/std.h>
#include <ti/sysbios/hal/Seconds.h>

#include <time.h>

#if defined(__clang__) && defined(__TI_TIME_USES_64) && __TI_TIME_USES_64

_CODE_ACCESS __time64_t __time64(__time64_t *_timer)
{
    UInt64 t;
    ti_sysbios_hal_Seconds_Time ts;

    ti_sysbios_hal_Seconds_getTime(&ts);

    t = ((UInt64)ts.secsHi << 32) + ts.secs;
    if (_timer != NULL) {
        *_timer = t;
    }

    return (t);
}

#else
/*
 *  ======== time ========
 */
time_t ATTRIBUTE time(time_t *tout)
{
    UInt32 t;

    /* Seconds_get() returns number of seconds since Jan 1, 1970 00:00:00 GMT. */
    t = ti_sysbios_hal_Seconds_get();

#if defined(__ti__)
    /*
     *  TI time() function returns seconds since 1900, so add the number
     *  of seconds from 1900 to 1970 (2208988800).
     */
    t += 2208988800;
#endif

    if (tout) {
        *tout = t;
    }

    return (t);
}
#endif

/*
 * ======== ti.sysbios.rom.ROM TEMPLATE ========
 */


/* ROM_ExternFuncPtrs */
#include <xdc/runtime/System.h>
#include <xdc/runtime/Startup.h>
#include <ti/sysbios/family/arm/cc26xx/Timer.h>
#include <ti/sysbios/family/arm/cc26xx/TimestampProvider.h>

typedef struct {
    /*
     *  functions explicitly excluded from the ROM
     */
    xdc_Int (*xdc_runtime_Startup_getState__I)(xdc_runtime_Types_ModuleId);
    xdc_Bool (*xdc_runtime_System_SupportProxy_Module__startupDone__S)(xdc_Void);
    xdc_Void (*xdc_runtime_System_SupportProxy_abort__E)(xdc_CString);
    xdc_Void (*xdc_runtime_System_SupportProxy_exit__E)( xdc_Int);
    xdc_Void (*xdc_runtime_System_SupportProxy_flush__E)(xdc_Void);
    xdc_Void (*xdc_runtime_System_SupportProxy_putch__E)( xdc_Char);
    xdc_Bool (*xdc_runtime_System_SupportProxy_ready__E)(xdc_Void);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_start__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_initDevice__I)(ti_sysbios_family_arm_cc26xx_Timer_Object *);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I)(ti_sysbios_family_arm_cc26xx_Timer_Object *, xdc_UInt32, xdc_Bool);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle, xdc_UInt32);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle);
    xdc_UInt64 (*ti_sysbios_family_arm_cc26xx_Timer_getCount64__E)(ti_sysbios_family_arm_cc26xx_Timer_Object *);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E)(xdc_UArg);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle, xdc_Bool);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E)(xdc_Void);
    xdc_Void (*xdc_runtime_Error_init__E)(xdc_runtime_Error_Block *);
    xdc_Char * (*xdc_runtime_System_formatNum__I)(xdc_Char *, xdc_UInt32, xdc_Int, xdc_Int);
} ROM_ExternFuncPtrs;

/* xdcRomExternFuncsPtr */
#pragma DATA_SECTION(ROM_externFuncPtrs, ".const:ROM_externFuncPtrs");
const ROM_ExternFuncPtrs ROM_externFuncPtrs = {
    xdc_runtime_Startup_getState__I,
    xdc_runtime_System_SupportProxy_Module__startupDone__S,
    xdc_runtime_System_SupportProxy_abort__E,
    xdc_runtime_System_SupportProxy_exit__E,
    xdc_runtime_System_SupportProxy_flush__E,
    xdc_runtime_System_SupportProxy_putch__E,
    xdc_runtime_System_SupportProxy_ready__E,
    ti_sysbios_family_arm_cc26xx_Timer_start__E,
    ti_sysbios_family_arm_cc26xx_Timer_initDevice__I,
    ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I,
    ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E,
    ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E,
    ti_sysbios_family_arm_cc26xx_Timer_getCount64__E,
    ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E,
    ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E,
    ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E,
    xdc_runtime_Error_init__E,
    xdc_runtime_System_formatNum__I,
};

/* xdcRomExternFuncsPtr */
#pragma DATA_SECTION(xdcRomExternFuncPtr, ".data:xdcRomExternFuncPtr");
const ROM_ExternFuncPtrs *xdcRomExternFuncPtr = &ROM_externFuncPtrs;



