BVO93/TI_CC2640R2_GetttingStarted/adc_window_monitor_launchpad_tirtos/Debug/configPkg/package/cfg/rom_pem4f.c
/* Module__loggerFxn4__C */
#pragma DATA_SECTION(ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn4__C, ".const:ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn4__C");
__FAR__ const CT__ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn4 ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn4__C = ((const CT__ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn4)NULL);

/* Module__loggerFxn8__C */
#pragma DATA_SECTION(ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn8__C, ".const:ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn8__C");
__FAR__ const CT__ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn8 ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn8__C = ((const CT__ti_sysbios_rts_ti_ReentSupport_Module__loggerFxn8)NULL);

/* Object__count__C */
#pragma DATA_SECTION(ti_sysbios_rts_ti_ReentSupport_Object__count__C, ".const:ti_sysbios_rts_ti_ReentSupport_Object__count__C");
__FAR__ const CT__ti_sysbios_rts_ti_ReentSupport_Object__count ti_sysbios_rts_ti_ReentSupport_Object__count__C = 0;

/* Object__heap__C */
#pragma DATA_SECTION(ti_sysbios_rts_ti_ReentSupport_Object__heap__C, ".const:ti_sysbios_rts_ti_ReentSupport_Object__heap__C");
__FAR__ const CT__ti_sysbios_rts_ti_ReentSupport_Object__heap ti_sysbios_rts_ti_ReentSupport_Object__heap__C = NULL;

/* Object__sizeof__C */
#pragma DATA_SECTION(ti_sysbios_rts_ti_ReentSupport_Object__sizeof__C, ".const:ti_sysbios_rts_ti_ReentSupport_Object__sizeof__C");
__FAR__ const CT__ti_sysbios_rts_ti_ReentSupport_Object__sizeof ti_sysbios_rts_ti_ReentSupport_Object__sizeof__C = 0;

/* Object__table__C */
#pragma DATA_SECTION(ti_sysbios_rts_ti_ReentSupport_Object__table__C, ".const:ti_sysbios_rts_ti_ReentSupport_Object__table__C");
__FAR__ const CT__ti_sysbios_rts_ti_ReentSupport_Object__table ti_sysbios_rts_ti_ReentSupport_Object__table__C = NULL;

/* A_badThreadType__C */
#pragma DATA_SECTION(ti_sysbios_rts_ti_ReentSupport_A_badThreadType__C, ".const:ti_sysbios_rts_ti_ReentSupport_A_badThreadType__C");
__FAR__ const CT__ti_sysbios_rts_ti_ReentSupport_A_badThreadType ti_sysbios_rts_ti_ReentSupport_A_badThreadType__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);


/*
 * ======== xdc.rov.support.ScalarStructs INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__diagsEnabled__C, ".const:xdc_rov_support_ScalarStructs_Module__diagsEnabled__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__diagsEnabled xdc_rov_support_ScalarStructs_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__diagsIncluded__C, ".const:xdc_rov_support_ScalarStructs_Module__diagsIncluded__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__diagsIncluded xdc_rov_support_ScalarStructs_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__diagsMask__C, ".const:xdc_rov_support_ScalarStructs_Module__diagsMask__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__diagsMask xdc_rov_support_ScalarStructs_Module__diagsMask__C = ((const CT__xdc_rov_support_ScalarStructs_Module__diagsMask)NULL);

/* Module__gateObj__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__gateObj__C, ".const:xdc_rov_support_ScalarStructs_Module__gateObj__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__gateObj xdc_rov_support_ScalarStructs_Module__gateObj__C = ((const CT__xdc_rov_support_ScalarStructs_Module__gateObj)NULL);

/* Module__gatePrms__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__gatePrms__C, ".const:xdc_rov_support_ScalarStructs_Module__gatePrms__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__gatePrms xdc_rov_support_ScalarStructs_Module__gatePrms__C = ((const CT__xdc_rov_support_ScalarStructs_Module__gatePrms)NULL);

/* Module__id__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__id__C, ".const:xdc_rov_support_ScalarStructs_Module__id__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__id xdc_rov_support_ScalarStructs_Module__id__C = (xdc_Bits16)0x16;

/* Module__loggerDefined__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__loggerDefined__C, ".const:xdc_rov_support_ScalarStructs_Module__loggerDefined__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__loggerDefined xdc_rov_support_ScalarStructs_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__loggerObj__C, ".const:xdc_rov_support_ScalarStructs_Module__loggerObj__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__loggerObj xdc_rov_support_ScalarStructs_Module__loggerObj__C = ((const CT__xdc_rov_support_ScalarStructs_Module__loggerObj)NULL);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__loggerFxn0__C, ".const:xdc_rov_support_ScalarStructs_Module__loggerFxn0__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn0 xdc_rov_support_ScalarStructs_Module__loggerFxn0__C = ((const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn0)NULL);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__loggerFxn1__C, ".const:xdc_rov_support_ScalarStructs_Module__loggerFxn1__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn1 xdc_rov_support_ScalarStructs_Module__loggerFxn1__C = ((const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn1)NULL);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__loggerFxn2__C, ".const:xdc_rov_support_ScalarStructs_Module__loggerFxn2__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn2 xdc_rov_support_ScalarStructs_Module__loggerFxn2__C = ((const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn2)NULL);

/* Module__loggerFxn4__C */
#pragma DATA_SECTION(xdc_rov_support_ScalarStructs_Module__loggerFxn4__C, ".const:xdc_rov_support_ScalarStructs_Module__loggerFxn4__C");
__FAR__ const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn4 xdc_rov_support_ScalarStructs_Module__loggerFxn4__C = ((const CT__xdc_rov_support_ScalarStructs_Module__loggerFxn4)NULL);

